Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/after_a_death/bringing_a_body_to_ireland_for_burial_or_cremation.html.txt.tmx
Source language: en
Languages: ga

source: Bringing a body to Ireland for burial or cremation
ga: Corp a thabhairt ar ais go hÉirinn chun é a adhlacadh nó a chréamadh

source: When someone dies abroad, particularly if the death was sudden or unexpected, it is often difficult to know how to deal with the practical matters you need to address
ga: Nuair a fhaigheann duine bás thar lear, go háirithe más rud é go raibh an bás sin tobann nó gan choinne, is minic a bhíonn sé deacair tabhairt faoi na hábhair phraiticiúla

source: Every country has its own rules about the formalities to be followed when someone dies
ga: Tá a cuid rialacha féin ag gach tír maidir leis na maidir leis na gnásanna atá le comhlíonadh nuair a fhaigheann duine bás

source: The purpose of the following information is to set out the general process and rules involved when bringing a body to Ireland for burial or cremation
ga: Sa bhfaisnéis seo a leanann, leagfar amach an próiseas ginearálta agus na rialacha a bhaineann le corp a thabhairt go hÉirinn chun é a adhlacadh nó a chréamadh

source: The information is aimed primarily at families of Irish citizens
ga: Dírítear an t-eolas ar theaghlaigh shaoránach Éireannach

source: Families of non-Irish nationals should contact the relevant embassy for their own country for advice, if they wish to bring a body to Ireland
ga: Ba chóir do theaghlaigh neamhnáisiúnach dul i dteagmháil le hambasáid a dtíortha féin i gcomhair comhairle, más mian leo corp a thabhairt go hÉirinn

source: A list of foreign embassies and consulates responsible for Ireland is available here
ga: Tá liosta ambasáidí agus consalachtaí eachtrannacha freagrach as Éirinn ar fáil anseo

source: You can read about sending a body out of Ireland here
ga: Is féidir léamh faoi chorp a sheoladh amach as Éirinn anseo

source: Repatriation of the remains of a deceased person to Ireland can be a complicated and costly process
ga: Féadann an próiseas chun an corp a thabhairt ar ais go hÉirinn le haghaidh sochraide a bheith casta agus costasach

source: You may therefore wish to consider having the body cremated abroad and having the ashes returned to Ireland
ga: Dá bharr sin, d'fhéadfá smaoineamh ar an gcorp a chréamadh thar lear agus na luaithrigh a fhilleadh go hÉirinn

source: Notification that an Irish citizen has died abroad
ga: Fógra go bhfuair an saoránach Éireannach bás thar lear

source: If the death of an Irish citizen is notified to the Irish embassy or consulate abroad, the Garda Sióchána in Ireland are asked to notify any family/next-of kin in Ireland
ga: Más rud é go bhfógraítear bás an tsaoránaigh Éireannaigh don ambasáid nó don chonsalacht Éireannach thar lear, iarrtar ar an nGarda Síochána in Éirinn aon teaghlach/neasghaol in Éirinn a chur ar an eolas

source: The embassy/consulate can also help communicate with the police or other authorities abroad
ga: Is féidir leis an ambasáid nó leis an gconsalacht cabhrú chomh maith chun cumarsáid a dhéanamh leis na póilíní nó na húdaráis eile thar lear

source: If you have been notified of the death of an Irish citizen abroad by a tour operator or by someone else, then you should contact the Irish embassy/eonsulate for that country for advice
ga: Más rud é gur thug tionscnóir turas nó duine eile fógra duit faoi bhás an tsaoránaigh Éireannaigh thar lear, ba chóir duit teagmháil a dhéanamh le hambasáid/consalacht Éireannach don tír úd chun comhairle a fháil

source: Formal identification of the remains
ga: Aithint fhoirmeálta an choirp

source: Before any arrangements can be made to return a body to Ireland, it will be necessary to have the remains formally identified
ga: Sula ndéanfar aon socruithe chun an corp a fhilleadh go hÉirinn beidh sé riachtanach an corp a aithint go foirmiúil

source: That is, it is necessary to have the identity of the deceased officially confirmed in line with the laws in that country
ga: Is é sin, ní mór aitheantas an duine éagtha a dhearbhú go hoifigiúil faoi réir na ndlíthe sa tír úd

source: The rules on who may formally identify a deceased person can vary, but usually identification may be carried out by a travelling companion or business colleague of the deceased
ga: Bíonn éagsúlacht sna rialacha ar cé is féidir leis an duine marbh a aithint, ach de ghnáth is féidir le compánach taistil nó comhghleacaí gnó an duine éagtha a aithint

source: Depending on local laws and rules however, it may be necessary for a family member to travel to the place where the deceased is, to confirm the identity
ga: Ag brath ar dhlíthe agus rialacha áitiúla áfach, b'fhéidir go mbeadh ar bhall teaghlaigh taisteal go dtí an áit ina bhfuil an duine éagtha, chun an aithint a dhearbhú

source: Further information on the local arrangements for formal identification of Irish citizens abroad is available from the Irish embassy for the country where the death occurred
ga: Tá tuilleadh eolais faoi na socruithe áitiúla maidir le haitheantas foirmeálta saoránach Éireannach thar lear ar fáil ó Ambasáid na hÉireann don tír inar tharla an bás

source: While the embassy may assist in obtaining documents such as death certificates, etc
ga: Cé gur féidir leis an Ambasáid cabhrú chun cáipéisí ar nós teastas báis a fháil, 7rl

source: it cannot help pay for the cost of relatives travelling to where a death occurs
ga: ní féidir léi íoc as costais na ngaolta ag taisteal go dtí an áit ina dtarlaíonn an bás

source: Neither can the embassy pay the costs of repatriation of bodies back to Ireland except in exceptional circumstances
ga: Ní féidir leis an Ambasáid íoc as na coirp a thabhairt ar ais go hÉirinn ach amháin in imthosca eisceachtúla

source: Appointing a funeral director
ga: Stiúrthóir sochraide a cheapadh

source: In order to obtain the release of the body for repatriation from the authorities in the country where the person died, you should appoint a funeral director in that country
ga: Ní mór cead scaoilte a fháil chun an corp a thabhairt ar ais le haghaidh sochraide, agus chun an cead sin a fháil ó na húdaráis sa tír ina bhfuair an duine bás, ba chóir duit stiúrthóir sochraide a cheapadh sa tír sin

source: A funeral director is someone whose business is to prepare the dead for burial and to arrange and manage funerals
ga: Is duine é an stiúrthóir ar leis an gnó na mairbh a ullmhú don adhlacadh agus sochraidí a shocrú agus a bhainistiú

source: Services of funeral directors are not free so you should check fees and costs associated prior to engaging these services
ga: Níl seirbhísí na stiúrthóirí sochraide saor in aisce, mar sin ba cheart duit táillí agus costais ag baint leis a sheiceáil sula bhfostaíonn tú na seirbhísí seo

source: If you live in Ireland and contact a funeral director here, your funeral director in Ireland can find a suitable funeral director in the other country and make the appropriate arrangements
ga: Má tá cónaí ort in Éirinn agus má dhéanann tú teagmháil le stiúrthóir sochraide anseo, is féidir le do stiúrthóir sochraide in Éirinn stiúrthóir sochraide feiliúnach a aimsiú sa tír eile agus na socruithe iomchuí a dhéanamh

source: Alternatively, the Irish embassy for the country can provide help to Irish citizens in appointing a local funeral director
ga: De mhalairt air sin, is féidir le hAmbasáid na hÉireann don tír cabhair a chur ar fáil do shaoránaigh Éireannacha, agus iad ag ceapadh stiúrthóra áitiúil

source: If the death occurred on a package holiday, the tour operator should be able to help with arrangements
ga: Más rud é gur tharla an bás i rith saoire láneagraithe, ba chóir go mbeadh an tionscnóir turas in ann cabhrú leat le socruithe

source: The local funeral director can prepare the body for repatriation. The funeral director can also prepare the appropriate documentation and obtain the death certificate if possible
ga: Is féidir leis an stiúrthóir sochraide áitiúil an corp a ullmhú chun é a thabhairt ar ais go dtí a thír féin Is féidir leis an stiúrthóir sochraide an cháipéisíocht iomchuí a ullmhú agus an teastas báis a fháil, má tá sé sin indéanta

source: Assistance is also available from the Irish embassy in obtaining documents such as the death certificate or medical reports
ga: Tá cabhair ar fáil chomh maith ó Ambasáid na hÉireann chun cáipéisí ar nós an teastas báis nó tuarascálacha leighis a fháil

source: The local funeral director can also make all the necessary flight arrangements
ga: Is féidir leis an stiúrthóir sochraide áitiúil na socruithe eitilte riachtanacha a dhéanamh

source: The repatriation of a body to Ireland must be notified to the coroner in Ireland for the district where the body is being flown to
ga: Ní mór filleadh an choirp go hÉirinn a chur in iúl don chróinéir in Éirinn atá freagrach as an gceantar a n-eitleofar an corp chuige

source: If you have appointed a funeral director in Ireland, the funeral director will contact the appropriate coroner with the required documentation
ga: Má tá stiúrthóir sochraide ceaptha agat in Éirinn, déanfaidh an stiúrthóir teagmháil leis an gcróinéir iomchuí leis an gcáipéisíocht riachtanach

source: Usually, bodies being repatriated to Ireland are flown to Dublin airport
ga: De ghnáth, eitlítear na coirp atá a dtabhairt ar ais go hÉirinn go haerfort Baile Átha Cliath

source: In that case, it is the Dublin District Coroner who must be notified
ga: Sa chás sin, ní mór Cróinéir Dúiche Bhaile Átha Cliath a chur ar an eolas

source: The appropriate documentation in relation to the deceased has to be made available to the coroner for clearance by the coroner's office
ga: Ní mór an cháipéisíocht iomchuí a bhaineann leis an duine éagtha a chur ar fáil don chróinéir chun cead oifig an chróinéara a fháil

source: The documentation required includes
ga: I measc na cáipéisíochta riachtanaí tá:

source: • Medical certificate giving cause of death
ga: • Teastas leighis ag léiriú cúis an bháis

source: • Certification as to whether a post-mortem examination has been carried out or not
ga: • Teastas ag dearbhú go ndearnadh nó nach ndearnadh scrúdú iarbháis

source: • Authorisation to remove the body from the other country
ga: • Údarú chun an corp a ghluaiseacht ón tír eile

source: • Certificate to the effect that the body is not coming from an area of infectious disease
ga: • Teastas ag dearbhú nach bhfuil an corp ag teacht ó cheantar buailte ag galar tógála

source: Where there are some concerns as to the circumstances of the death, the coroner may direct that an examination of the body be carried out
ga: Sa chás go bhfuil amhras faoi chúinsí an bháis, d'fhéadfadh an cróinéir scrúdú an choirp a ordú

source: Read more about the powers of coroners here
ga: Léigh níos mo faoi chumas na gcróinéirí anseo

source: Funeral arrangements in Ireland should not be confirmed until the coroner's office has cleared the documentation
ga: Níor chóir socruithe sochraide in Éirinn a dhearbhú go dtí go dtagann cead ó oifig an chróinéara

source: International regulations (Article 3 of the League of Nations International Regulations concerning the conveyance of corpses, 1937 and the Council of Europe Agreement on the Transfer of Corpses 1973) require all coffins crossing international frontiers by air or sea to be metal (zinc or lead) lined and sealed
ga: De réir na rialacha idirnáisiúnta (Airteagal 3 de Rialacha Idirnáisiúnta Chonradh na Náisiún maidir le hiompar corpán, 1937 agus Comhaontú Chomhairle na hEorpa ar Aistriú Corpán 1973), nuair a bhíonn cónraí ag gabháil thar teorainneacha idirnáisiúnta, ní mór dóibh a bheith déanta as miotal (sinc nó luaidhe)agus ní mór dóibh a bheith líneálta agus séalaithe

source: These coffins are therefore not suitable for cremation and either the lining has to be removed or another coffin provided if the body is to be cremated in Ireland
ga: Ní féidir na cónraí sin a chréamadh mar sin agus ní foláir an líneáil a bhaint nó ní foláir cónra eile a sholáthar má tá an corp le créamadh in Éirinn

source: Read more about funerals and cremations here
ga: Léigh níos mó maidir le sochraidí agus le créamadh anseo

source: If the death is registered in the country where the person died, it is not normally registered in Ireland
ga: Má tá an bás cláraithe sa tír inar bhásaigh an duine, ní chláraítear an bás in Éirinn de ghnáth

source: Where a system of registration does not exist in that country or where it is not possible to obtain copies of the relevant civil registration record (death certificate), you should contact the General Register Office in Ireland to see if the death can be registered in Ireland
ga: Mura bhfuil córas cláraithe sa tír sin nó mura féidir cóipeanna den taifead cláraithe sibhialta iomchuí (teastas báis) a fháil, ba chóir duit dul i dteagmháil leis an bPríomh-Oifig Chlárúcháin in Éirinn le seiceáil an féidir an bás a chlárú in Éirinn

source: A death certificate is an important legal document, evidence of which is frequently required in Ireland in order to deal with the deceased's estate, access money, etc
ga: Is cáipéis dlí thábhachtach é an teastas báis, agus bíonn fianaise de ag teastáil go minic in Éirinn chun déileáil le heastát, airgead rochtana 7rl de chuid an duine éagtha

source: Read more about dealing with the deceased persons estate here
ga: Léigh níos mó faoi déileáil le heastát an duine éagtha anseo

source: While Irish embassies provide consular services to Irish nationals abroad, this does not extend to non-EU nationals
ga: Cé go gcuireann ambasáidí na hÉireann seirbhísí consalachta ar fáil do náisiúnaigh Éireannacha thar lear, ní chuirtear an tseirbhís seo ar fáil do náisiúnaigh lasmuigh den AE

source: nationals of other countries should avail of consular services from their own countries' embassies and consulates
ga: Ba chóir do náisiúnaigh tíortha eile leas a bhaint as seirbhísí consalachta a chuireann Ambasáidí agus Consalachtaí óna dtíortha féin ar fáil

source: Repatriation of a deceased person to Ireland can be very expensive, depending on the distance to be travelled and other factors
ga: Féadann costas suntasach bheith i gceist le duine éagtha a thabhairt ar ais go hÉirinn, ag brath ar fhad an aistir atá le taisteal agus cúinsí eile

source: Check whether the person had travel insurance or private medical cover to help cover the costs
ga: Ní mór seiceáil a dhéanamh ar árachas taistil nó ar chlúdach árachais sláinte an duine éagtha, a chabhródh leis na costais

source: Financial assistance with the cost of repatriation of a dead body is not available from the Irish embassy
ga: Ní chuireann Ambasáid na hÉireann cabhair airgeadais ar fáil leis an corp a thabhairt ar ais abhaile

source: Contact information for all Irish embassies and consulates abroad is available here
ga: Tá faisnéis teagmhála faoi ambasáidí agus chonsalachtaí na hÉireann ar fud an domhain ar fáil anseo
